teddokano/mcx-arduino-core/hardware/nxp/mcx/variants/frdm_mcxn947/svd/MCXN947_cm33_core0.svd
        <register>
          <name>pkc_xyptr2</name>
          <description>X+Y pointer register, parameter set 2</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>xptr</name>
              <description>Start address of X operand in PKCRAM with byte granularity: Least significant bits are ignored depending on PKC_CTRL.REDMUL setting. Most significant bits are ignored depending on available PKCRAM size.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>yptr</name>
              <description>Start address of Y operand in PKCRAM with byte granularity: Least significant bits are ignored depending on PKC_CTRL.REDMUL setting. Most significant bits are ignored depending on available PKCRAM size.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pkc_zrptr2</name>
          <description>Z+R pointer register, parameter set 2</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>zptr</name>
              <description>Start address of Z operand in PKCRAM with byte granularity or constant for calculation modes using CONST:</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rptr</name>
              <description>Start address of R result in PKCRAM with byte granularity: Least significant bits are ignored depending on PKC_CTRL.REDMUL setting. Most significant bits are ignored depending on available PKCRAM size.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pkc_len2</name>
          <description>Length register, parameter set 2</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>len</name>
              <description>Operand length: LEN defines the length of the operands and the result in bytes. The length of Y, Z and R depend furthermore on the selected calculation mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mclen</name>
              <description>Loop counter for microcode pattern: MCLEN defines the length of the loop counter that can be used in L1 calculation mode, e.g. in MC opcode DecrTBNZ. For the hardcoded MC patterns Modular Multiplication (MC start address 0x00)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pkc_uptr</name>
          <description>Universal pointer FUP program</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ptr</name>
              <description>Pointer to start address of PKC FUP program: PKC_UPTR needs to be defined before starting a universal pointer PKC calculation (L2) via PKC_CTRL.GOU. The pointer address needs to be valid and the memory space the pointer addresses needs to be enabled for PKC access by the system. Otherwise a security alarm is triggered (PKC_ACCESS_ERR.AHB is set).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pkc_uptrt</name>
          <description>Universal pointer FUP table</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ptr</name>
              <description>Pointer to start address of PKC FUP table: PKC_UPTRT needs to be defined before starting a universal pointer PKC calculation (L2) via PKC_CTRL.GOU. The pointer address needs to be valid and the memory space the pointer addresses needs to be enabled for PKC access by the system. Otherwise a security alarm is triggered (PKC_ACCESS_ERR.AHB is set).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pkc_ulen</name>
          <description>Universal pointer length</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>len</name>
              <description>Length of universal pointer calculation: PKC_ULEN defines how many FUP program entries shall be processed for one L2 calculation started via PKC_CTRL.GOU. The FUP program entries include L0 calculations, L1 calculations and CRC entries for FUP program integrity protection.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>reserved31</name>
              <description>reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pkc_mcdata</name>
          <description>MC pattern data interface</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mcdata</name>
              <description>Microcode read/write data: This IP version does not support flexible MC patterns (only hard coded ones). Any read or write access to PKC_MCDATA triggers a security alarm (PKC_ACCESS_ERR.CTRL is set).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pkc_version</name>
          <description>PKC version register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xBE</resetValue>
          <resetMask>0xFFFFF</resetMask>
          <fields>
            <field>
              <name>mulsize</name>
              <description>native multiplier size and operand granularity</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALUE_32b</name>
                  <description>32-bit multiplier</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_64b</name>
                  <description>64-bit multiplier</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALUE_128b</name>
                  <description>128-bit multiplier</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>mcavail</name>
              <description>MC feature (L1 calculation) is available</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>upavail</name>
              <description>UP feature (L2 calculation) is available</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>upcacheavail</name>
              <description>UP cache is available</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>gf2avail</name>
              <description>GF2 calculation modes are available</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>paramnum</name>
              <description>Number of parameter sets for real calculation</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>sbx0avail</name>
              <description>SBX0 operation is available</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>sbx1avail</name>
              <description>SBX1 operation is available</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>sbx2avail</name>
              <description>SBX2 operation is available</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>sbx3avail</name>
              <description>SBX3 operation is available</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>mcreconf_size</name>
              <description>Size of reconfigurable MC table in bytes</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reserved31</name>
              <description>reserved</description>
              <bitOffset>20</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pkc_soft_rst</name>
          <description>Software reset</description>
          <addressOffset>0xFB0</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>soft_rst</name>
              <description>Write 1 to reset module (0 has no effect). All running and pending PKC calculation are stopped. All PKC SFRs are reset except PKC_ACCESS_ERR.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>reserved31</name>
              <description>reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>31</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pkc_access_err</name>
          <description>Access Error</description>
          <addressOffset>0xFC0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xF04F3</resetMask>
          <fields>
            <field>
              <name>apb_notav</name>
              <description>APB Error: address not available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>apb_wrgmd</name>
              <description>APB Error: Wrong access mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reserved3</name>
              <description>reserved for future erors on APB I/F</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>apb_master</name>
              <description>APB Master that triggered first APB error (APB_WRGMD or APB_NOTAV)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reserved9</name>
              <description>reserved for future erors on AHB I/F L2 Only</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ahb</name>
              <description>AHB Error: invalid AHB access L2 Only</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reserved15</name>
              <description>reserved for future erors on AHB I/F L2 Only</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>pkcc</name>
              <description>Error in PKC coprocessor kernel</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>fdet</name>
              <description>Error due to error detection circuitry</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ctrl</name>
              <description>Error in PKC software control</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ucrc</name>
              <description>Error in L2 CRC check</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reserved20</name>
              <description>reserved</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reserved31</name>
              <description>reserved for more block errors</description>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pkc_access_err_clr</name>
          <description>Clear Access Error</description>
          <addressOffset>0xFC4</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>err_clr</name>
              <description>Write 1 to reset PKC_ACCESS_ERR SFR.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>reserved31</name>
              <description>reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>31</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pkc_int_clr_enable</name>
          <description>Interrupt enable clear</description>
          <addressOffset>0xFD8</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>en_pdone</name>
              <description>Write to clear PDONE interrupt enable flag (PKC_INT_ENABLE.EN_PDONE=0).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>reserved1</name>
              <description>reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>reserved31</name>
              <description>reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pkc_int_set_enable</name>
          <description>Interrupt enable set</description>
          <addressOffset>0xFDC</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>en_pdone</name>
              <description>Write to set PDONE interrupt enable flag (PKC_INT_ENABLE.EN_PDONE=1).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>reserved1</name>
              <description>reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>reserved31</name>
              <description>reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pkc_int_status</name>
          <description>Interrupt status</description>
          <addressOffset>0xFE0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>int_pdone</name>
              <description>End-of-computation status flag: INT_PDONE is set after EACH single PKC L0 or L1 calculation. In case of a universal pointer calculation (L2) INT_PDONE is set at the end of the pipe calculation when PKC_ULEN has been decremented to zero and the final PKC calculation has completed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reserved1</name>
              <description>reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reserved31</name>
              <description>reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pkc_int_enable</name>
          <description>Interrupt enable</description>
          <addressOffset>0xFE4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>en_pdone</name>
              <description>PDONE interrupt enable flag: If EN_PDONE=1 an interrupt is triggered every time PKC_INT_STATUS.INT_PDONE is set. Otherwise the interrupt generation is suppressed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reserved1</name>
              <description>reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reserved31</name>
              <description>reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pkc_int_clr_status</name>
          <description>Interrupt status clear</description>
          <addressOffset>0xFE8</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>int_pdone</name>
              <description>Write to clear End-of-computation status flag (PKC_INT_STATUS.INT_PDONE=0).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>reserved1</name>
              <description>reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>reserved31</name>
              <description>reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
