teddokano/mcx-arduino-core/hardware/nxp/mcx/variants/frdm_mcxn947/svd/MCXN947_cm33_core0.svd
        <register>
          <name>pkc_int_set_status</name>
          <description>Interrupt status set</description>
          <addressOffset>0xFEC</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>int_pdone</name>
              <description>Write to set End-of-computation status flag (PKC_INT_STATUS.INT_PDONE=1) to trigger a PKC interrupt via software, e.g. for debug purposes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>reserved1</name>
              <description>reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>reserved31</name>
              <description>reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pkc_module_id</name>
          <description>Module ID</description>
          <addressOffset>0xFFC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xE1031280</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>size</name>
              <description>Address space of the IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>minor_rev</name>
              <description>Minor revision</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>major_rev</name>
              <description>Major revision</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>id</name>
              <description>Module ID</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PUF</name>
      <description>PUF</description>
      <groupName>PUF</groupName>
      <headerStructName>PUF</headerStructName>
      <baseAddress>0x4002C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x3F0</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PUF</name>
        <value>75</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>Control</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ZEROIZE</name>
              <description>Zeroize operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENROLL</name>
              <description>Enroll operation</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>START</name>
              <description>Start operation</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECONSTRUCT</name>
              <description>Reconstruct operation</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP</name>
              <description>Stop operation</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GET_KEY</name>
              <description>Get Key operation</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNWRAP</name>
              <description>Unwrap operation</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRAP_GENERATED_RANDOM</name>
              <description>Wrap Generated Random operation</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRAP</name>
              <description>Wrap operation</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GENERATE_RANDOM</name>
              <description>Generate Random operation</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEST_MEMORY</name>
              <description>Test memory operation</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEST_PUF</name>
              <description>Test PUF operation</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ORR</name>
          <description>Operation Result</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RESULT_CODE</name>
              <description>Result code of last operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OK</name>
                  <description>Indicates that the last operation was successful or operation is in progress.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_PRODUCT</name>
                  <description>Indicates that the AC is not for the current product/version.</description>
                  <value>0xF0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_PRODUCT_PH2</name>
                  <description>Indicates that the AC in the second phase is not for the current product/version.</description>
                  <value>0xF1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_TRANSFER</name>
                  <description>Indicates that the AC is corrupted.</description>
                  <value>0xF2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_TRANSFER_PH2</name>
                  <description>Indicates that the AC in the second phase is corrupted.</description>
                  <value>0xF3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_AUTH</name>
                  <description>Indicates that the authentication of the provided AC failed.</description>
                  <value>0xF4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_AUTH_PH2</name>
                  <description>Indicates that the authentication of the provided AC failed in the second phase.</description>
                  <value>0xF5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_PUF_QUALITY</name>
                  <description>Indicates that the SRAM PUF quality verification fails.</description>
                  <value>0xF6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_CONTEXT</name>
                  <description>Indicates that the incorrect or unsupported context is provided.</description>
                  <value>0xF7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_DESTINATION</name>
                  <description>Indicates that a data destination was set that is not allowed according to other settings and the current PUF state.</description>
                  <value>0xF8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAILURE</name>
                  <description>Indicates that the PUF SRAM access has failed.</description>
                  <value>0xFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAST_OPERATION</name>
              <description>Last operation type</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_PROGRESS</name>
                  <description>Indicates that the operation is in progress.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_ENROLL</name>
                  <description>Indicates that the last operation was Enroll.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_START</name>
                  <description>Indicates that the last operation was Start.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_RECONSTRUCT</name>
                  <description>Indicates that the last operation was Reconstruct</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_STOP</name>
                  <description>Indicates that the last operation was Stop.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_GET_KEY</name>
                  <description>Indicates that the last operation was Get Key.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_UNWRAP</name>
                  <description>Indicates that the last operation was Unwrap.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_WRAP_GEN_RND</name>
                  <description>Indicates that the last operation was Wrap Generated Random.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_WRAP</name>
                  <description>Indicates that the last operation was Wrap.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_GEN_RND</name>
                  <description>Indicates that the last operation was Generate Random.</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_TEST_MEMORY</name>
                  <description>Indicates that the last operation was Test Memory.</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_TEST_PUF</name>
                  <description>Indicates that the last operation was Test PUF.</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_INITIALIZATION</name>
                  <description>Indicates that the last operation was Initialization.</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_ZEROIZE</name>
                  <description>Indicates that the last operation was Zeroize.</description>
                  <value>0x2F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Status</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>Operation in progress</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OK</name>
              <description>Last operation successful</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERROR</name>
              <description>Last operation failed</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ZEROIZED</name>
              <description>Zeroized or Locked state</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REJECTED</name>
              <description>Operation rejected</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>DI_REQUEST</name>
              <description>Indicates the request for data in transfer via the DIR register</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DO_REQUEST</name>
              <description>Indicates the request for data out transfer via the DOR register</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
