teddokano/mcx-arduino-core/hardware/nxp/mcx/variants/frdm_mcxn947/svd/MCXN947_cm33_core0.svd
        <register>
          <name>SRDROR</name>
          <description>Target Receive Data Read Only</description>
          <addressOffset>0x178</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x4000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Receive data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RADDR</name>
              <description>Received address</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXEMPTY</name>
              <description>Receive empty</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_EMPTY</name>
                  <description>The Receive Data Register is not empty</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMPTY</name>
                  <description>The Receive Data Register is empty</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOF</name>
              <description>Start of frame</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_FIRST_DATA_WORD</name>
                  <description>Is not the first data word since a (repeated) START or STOP condition</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRST_DATA_WORD</name>
                  <description>Is the first data word since a (repeated) START or STOP condition</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>128</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>MTCBR[%s]</name>
          <description>Controller Transmit Command Burst</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CMD</name>
              <description>Command</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>253</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>MTDBR[%s]</name>
          <description>Transmit Data Burst</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA0</name>
              <description>Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DATA1</name>
              <description>Data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DATA2</name>
              <description>Data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DATA3</name>
              <description>Data</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="LPI2C0">
      <name>LPI2C1</name>
      <description>LPI2C</description>
      <groupName>LPI2C</groupName>
      <baseAddress>0x40093800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7F4</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_FLEXCOMM1</name>
        <value>36</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPI2C0">
      <name>LPI2C2</name>
      <description>LPI2C</description>
      <groupName>LPI2C</groupName>
      <baseAddress>0x40094800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7F4</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_FLEXCOMM2</name>
        <value>37</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPI2C0">
      <name>LPI2C3</name>
      <description>LPI2C</description>
      <groupName>LPI2C</groupName>
      <baseAddress>0x40095800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7F4</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_FLEXCOMM3</name>
        <value>38</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPI2C0">
      <name>LPI2C4</name>
      <description>LPI2C</description>
      <groupName>LPI2C</groupName>
      <baseAddress>0x400B4800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7F4</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_FLEXCOMM4</name>
        <value>39</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPI2C0">
      <name>LPI2C5</name>
      <description>LPI2C</description>
      <groupName>LPI2C</groupName>
      <baseAddress>0x400B5800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7F4</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_FLEXCOMM5</name>
        <value>40</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPI2C0">
      <name>LPI2C6</name>
      <description>LPI2C</description>
      <groupName>LPI2C</groupName>
      <baseAddress>0x400B6800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7F4</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_FLEXCOMM6</name>
        <value>41</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPI2C0">
      <name>LPI2C7</name>
      <description>LPI2C</description>
      <groupName>LPI2C</groupName>
      <baseAddress>0x400B7800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7F4</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_FLEXCOMM7</name>
        <value>42</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPI2C0">
      <name>LPI2C8</name>
      <description>LPI2C</description>
      <groupName>LPI2C</groupName>
      <baseAddress>0x400B8800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7F4</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_FLEXCOMM8</name>
        <value>43</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPI2C0">
      <name>LPI2C9</name>
      <description>LPI2C</description>
      <groupName>LPI2C</groupName>
      <baseAddress>0x400B9800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7F4</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_FLEXCOMM9</name>
        <value>44</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>GPIO0</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <headerStructName>GPIO</headerStructName>
      <baseAddress>0x40096000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x128</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO00</name>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>GPIO01</name>
        <value>18</value>
      </interrupt>
      <registers>
        <register>
          <name>VERID</name>
          <description>Version ID</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x2010001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FEATURE</name>
              <description>Feature Specification Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>feature0</name>
                  <description>Basic implementation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>feature1</name>
                  <description>Protection registers implemented.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MINOR</name>
              <description>Minor Version Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR</name>
              <description>Major Version Number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAM</name>
          <description>Parameter</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQNUM</name>
              <description>Interrupt Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCK</name>
          <description>Lock</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PCNS</name>
              <description>Lock PCNS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pcns0</name>
                  <description>PCNS register is writable by software in Secure-Privilege state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pcns1</name>
                  <description>PCNS register is not writable until the next reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICNS</name>
              <description>Lock ICNS</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>icns0</name>
                  <description>ICNS register is writable by software in Secure-Privilege state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>icns1</name>
                  <description>ICNS register is not writable until the next reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PCNP</name>
              <description>Lock PCNP</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pcnp0</name>
                  <description>PCNP register is writable by software in Secure-Privilege state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pcnp1</name>
                  <description>PCNP register is not writable until the next reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICNP</name>
              <description>Lock ICNP</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>icnp0</name>
                  <description>ICNP register is writable by software in Secure-Privilege state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>icnp1</name>
                  <description>ICNP register is not writable until the next reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
