teddokano/mcx-arduino-core/hardware/nxp/mcx/variants/frdm_mcxn947/svd/MCXN947_cm33_core0.svd
        <register>
          <name>TIMER2_BC11</name>
          <description>TIMER2_BC11</description>
          <alternateGroup>TIMER2</alternateGroup>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x280001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHECK_DM</name>
              <description>Time Before Check of D- Line</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MS_1</name>
                  <description>1 ms - 15 ms</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_2</name>
                  <description>1 ms - 15 ms</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_3</name>
                  <description>1 ms - 15 ms</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_4</name>
                  <description>1 ms - 15 ms</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_5</name>
                  <description>1 ms - 15 ms</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_6</name>
                  <description>1 ms - 15 ms</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_7</name>
                  <description>1 ms - 15 ms</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_8</name>
                  <description>1 ms - 15 ms</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_9</name>
                  <description>1 ms - 15 ms</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_10</name>
                  <description>1 ms - 15 ms</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TVDPSRC_CON</name>
              <description>Time Period Before Enabling D+ Pullup</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MS_1</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_2</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_3</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_4</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_5</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_6</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_7</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_8</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_9</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_10</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER2_BC12</name>
          <description>TIMER2_BC12</description>
          <alternateGroup>TIMER2</alternateGroup>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10028</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TVDMSRC_ON</name>
              <description>TVDMSRC_ON</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MS_0</name>
                  <description>0 ms - 40 ms</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1</name>
                  <description>0 ms - 40 ms</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_2</name>
                  <description>0 ms - 40 ms</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_3</name>
                  <description>0 ms - 40 ms</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_4</name>
                  <description>0 ms - 40 ms</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_5</name>
                  <description>0 ms - 40 ms</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_6</name>
                  <description>0 ms - 40 ms</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_7</name>
                  <description>0 ms - 40 ms</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_8</name>
                  <description>0 ms - 40 ms</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_9</name>
                  <description>0 ms - 40 ms</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TWAIT_AFTER_PRD</name>
              <description>TWAIT_AFTER_PRD</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MS_1</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_2</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_3</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_4</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_5</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_6</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_7</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_8</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_9</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_10</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
