teddokano/mcx-arduino-core/hardware/nxp/mcx/variants/frdm_mcxn947/svd/MCXN947_cm33_core0.svd
        <register>
          <name>TCR5</name>
          <description>Transmit Configuration 5</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FBT</name>
              <description>First Bit Shifted</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INDEX0</name>
                  <description>Bit index is 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_1</name>
                  <description>Bit index is FBT value.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_2</name>
                  <description>Bit index is FBT value.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_3</name>
                  <description>Bit index is FBT value.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_4</name>
                  <description>Bit index is FBT value.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_5</name>
                  <description>Bit index is FBT value.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_6</name>
                  <description>Bit index is FBT value.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_7</name>
                  <description>Bit index is FBT value.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_8</name>
                  <description>Bit index is FBT value.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_9</name>
                  <description>Bit index is FBT value.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX31</name>
                  <description>Bit index is 31.</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>W0W</name>
              <description>Word 0 Width</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIGHT</name>
                  <description>8 bits per word</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NINE</name>
                  <description>9 bits per word</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN_THIRTYONE_9</name>
                  <description>(W0W value + 1) bits per word</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN_THIRTYONE_10</name>
                  <description>(W0W value + 1) bits per word</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN_THIRTYONE_11</name>
                  <description>(W0W value + 1) bits per word</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN_THIRTYONE_12</name>
                  <description>(W0W value + 1) bits per word</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN_THIRTYONE_13</name>
                  <description>(W0W value + 1) bits per word</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN_THIRTYONE_14</name>
                  <description>(W0W value + 1) bits per word</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN_THIRTYONE_15</name>
                  <description>(W0W value + 1) bits per word</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN_THIRTYONE_16</name>
                  <description>(W0W value + 1) bits per word</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAX</name>
                  <description>32 bits per word</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WNW</name>
              <description>Word N Width</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIGHT</name>
                  <description>8 bits per word</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NINE</name>
                  <description>9 bits per word</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN_THIRTYONE_9</name>
                  <description>(WNW value + 1) bits per word</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN_THIRTYONE_10</name>
                  <description>(WNW value + 1) bits per word</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN_THIRTYONE_11</name>
                  <description>(WNW value + 1) bits per word</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN_THIRTYONE_12</name>
                  <description>(WNW value + 1) bits per word</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN_THIRTYONE_13</name>
                  <description>(WNW value + 1) bits per word</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN_THIRTYONE_14</name>
                  <description>(WNW value + 1) bits per word</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN_THIRTYONE_15</name>
                  <description>(WNW value + 1) bits per word</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN_THIRTYONE_16</name>
                  <description>(WNW value + 1) bits per word</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAX</name>
                  <description>32 bits per word</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TDR[%s]</name>
          <description>Transmit Data</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TDR</name>
              <description>Transmit Data Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TFR[%s]</name>
          <description>Transmit FIFO</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RFP</name>
              <description>Read FIFO Pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WFP</name>
              <description>Write FIFO Pointer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WCP</name>
              <description>Write Channel Pointer</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>FIFO Combine mode is enabled for FIFO writes and this FIFO will be written on the next FIFO write.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR</name>
          <description>Transmit Mask</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TWM</name>
              <description>Transmit Word Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WORD_N_ENABLED</name>
                  <description>Word N is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD_N_MASKED</name>
                  <description>Word N is masked. The transmit data pins are 3-stated or drive zero when masked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
