teddokano/mcx-arduino-core/hardware/nxp/mcx/variants/frdm_mcxn947/svd/MCXN947_cm33_core0.svd
        <register>
          <name>PLL_SIC_CLR</name>
          <description>PLL SIC Register</description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x6912000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>MISC2_CONTROL0</name>
              <description>Determines USB PLL operation status during Suspend</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>PLL_EN_USB_CLKS</name>
              <description>PLL multi-phase clock outputs enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>PLL_POWER</name>
              <description>USB PLL powerup control</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>PLL_ENABLE</name>
              <description>PLL output clock enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>PLL_BYPASS</name>
              <description>Bypass USB PLL</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>REFBIAS_PWD_SEL</name>
              <description>Reference bias power control</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>REFBIAS_PWD</name>
              <description>Power down reference bias</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>PLL_REG_ENABLE</name>
              <description>Enable PLL regulator</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>PLL_DIV_SEL</name>
              <description>PLL divider value configuration</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>PLL_LOCK</name>
              <description>USB PLL lock status indicator</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL_SIC_TOG</name>
          <description>PLL SIC Register</description>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x6912000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToToggle</modifiedWriteValues>
          <fields>
            <field>
              <name>MISC2_CONTROL0</name>
              <description>Determines USB PLL operation status during Suspend</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>PLL_EN_USB_CLKS</name>
              <description>PLL multi-phase clock outputs enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>PLL_POWER</name>
              <description>USB PLL powerup control</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>PLL_ENABLE</name>
              <description>PLL output clock enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>PLL_BYPASS</name>
              <description>Bypass USB PLL</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>REFBIAS_PWD_SEL</name>
              <description>Reference bias power control</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>REFBIAS_PWD</name>
              <description>Power down reference bias</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>PLL_REG_ENABLE</name>
              <description>Enable PLL regulator</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>PLL_DIV_SEL</name>
              <description>PLL divider value configuration</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>PLL_LOCK</name>
              <description>USB PLL lock status indicator</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB1_VBUS_DETECT</name>
          <description>VBUS Detect Register</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x700004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VBUSVALID_THRESH</name>
              <description>VBUS comparator threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VBUS_VLD_4P0</name>
                  <description>4.0 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUS_VLD_4P1</name>
                  <description>4.1 V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUS_VLD_4P2</name>
                  <description>4.2 V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUS_VLD_4P3</name>
                  <description>4.3 V</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUS_VLD_4P4</name>
                  <description>4.4 V (Default)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUS_VLD_4P5</name>
                  <description>4.5 V</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUS_VLD_4P6</name>
                  <description>4.6 V</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUS_VLD_4P7</name>
                  <description>4.7 V</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUS_OVERRIDE_EN</name>
              <description>VBUS detect signal local override</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VBUS_NO_OVERRIDE</name>
                  <description>Use the results of the internal VBUS_VALID and Session Valid comparators for VBUS_VALID, AVALID, BVALID, and SESSEND</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUS_OVERRIDE</name>
                  <description>Use the override values for VBUS_VALID, AVALID, BVALID, and SESSEND</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SESSEND_OVERRIDE</name>
              <description>Override value for SESSEND</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BVALID_OVERRIDE</name>
              <description>Override value for B-Device Session Valid</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AVALID_OVERRIDE</name>
              <description>Override value for A-Device Session Valid</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VBUSVALID_OVERRIDE</name>
              <description>Override value for VBUS_VALID signal sent to the USB subsystem</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VBUSVALID_SEL</name>
              <description>Selects the source of the VBUS_VALID signal reported to the USB subsystem</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VBUS_VLD_OUT</name>
                  <description>Use the VBUS_VALID comparator results for signal reported to the USB subsystem</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUS_VLD_3V_OUT</name>
                  <description>Use the VBUS_VALID_3V comparator results for signal reported to the USB subsystem</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUS_SOURCE_SEL</name>
              <description>Selects the source of the VBUS_VALID signal reported to the USB subsystem</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USE_VBUS_VLD</name>
                  <description>Use the VBUS_VALID comparator results for signal reported to the USB subsystem</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_ASESS_VLD</name>
                  <description>Use the Session Valid comparator results for signal reported to the USB subsystem</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BSESS_VLD</name>
                  <description>Use the Session Valid comparator results for signal reported to the USB subsystem</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ID_OVERRIDE_EN</name>
              <description>Enable local ID pin status override</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_PHY_ID_OVERRIDE</name>
                  <description>Use PHY's ID pin detector or external override for ID status</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_PHY_ID_OVERRIDE</name>
                  <description>Allow local override of ID pin detection status</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ID_OVERRIDE</name>
              <description>ID pin status local override value</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXT_ID_OVERRIDE_EN</name>
              <description>Enable external ID pin status override using value supplied from outside the PHY</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USE_PHY_ID</name>
                  <description>Determine the reported ID pin status results using the PHY's internal detector or local override</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_EXT_ID</name>
                  <description>Determine the reported ID pin status results using the external ID signal value</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXT_VBUS_OVERRIDE_EN</name>
              <description>Enable external VBUS override using value supplied from outside the PHY</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USE_PHY_VBUS</name>
                  <description>Determine the reported VBUS detection results using the PHY's internal comparators/detectors or local overrides</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_EXT_VBUS</name>
                  <description>Determine the reported VBUS detection results using the external VBUS_VALID value</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUSVALID_TO_B</name>
              <description>Selects the comparator used for VBUS_VALID</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USE_VBUS_VLD</name>
                  <description>Use the VBUS_VALID comparator for VBUS_VALID results</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_SESS_VLD</name>
                  <description>Use the Session Valid detector for VBUS_VALID results. The Session Valid threshold is &gt;= 0.8V and &lt;= 4.0V.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUSVALID_PWRUP_CMPS</name>
              <description>Individual enable controls for the VBUS detection comparators</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VBUS_VALID_DISABLE</name>
                  <description>Power down the VBUS_VALID comparator</description>
                  <value>#xx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUS_VALID_ENABLE</name>
                  <description>Enable the VBUS_VALID comparator</description>
                  <value>#xx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISCHARGE_VBUS</name>
              <description>Controls VBUS discharge resistor</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VBUS_DCHG_OFF</name>
                  <description>VBUS discharge resistor is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUS_DCHG_ON</name>
                  <description>VBUS discharge resistor is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
