teddokano/mcx-arduino-core/hardware/nxp/mcx/variants/frdm_mcxn947/svd/MCXN947_cm33_core0.svd
        <register>
          <name>USB1_CHRG_DET_STAT</name>
          <description>Charger Detect Status Register</description>
          <addressOffset>0xF0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLUG_CONTACT</name>
              <description>Battery Charging Data Contact Detection phase output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DC_DETECTED</name>
                  <description>No USB cable attachment has been detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DC_DETECED</name>
                  <description>A USB cable attachment between the device and host has been detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHRG_DETECTED</name>
              <description>Battery Charging Primary Detection phase output</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SDP_DETECT</name>
                  <description>Standard Downstream Port (SDP) has been detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHRG_PORT_DETECT</name>
                  <description>Charging Port has been detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DM_STATE</name>
              <description>DM voltage</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DM_SERX_LO</name>
                  <description>USB_DM pin voltage is &lt;= 0.8V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DM_SERX_HI</name>
                  <description>USB_DM pin voltage is &gt;= 2.0V</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DP_STATE</name>
              <description>DP voltage</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DP_SERX_LO</name>
                  <description>USB_DP pin voltage is &lt;= 0.8V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DP_SERX_HI</name>
                  <description>USB_DP pin voltage is &gt;= 2.0V</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SECDET_DCP</name>
              <description>Battery Charging Secondary Detection phase output</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SECDET_CDP</name>
                  <description>Charging Downstream Port (CDP) has been detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECDET_DCP</name>
                  <description>Downstream Charging Port (DCP) has been detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB1_CHRG_DET_STAT_SET</name>
          <description>Charger Detect Status Register</description>
          <addressOffset>0xF4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToSet</modifiedWriteValues>
          <fields>
            <field>
              <name>PLUG_CONTACT</name>
              <description>Battery Charging Data Contact Detection phase output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>CHRG_DETECTED</name>
              <description>Battery Charging Primary Detection phase output</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>DM_STATE</name>
              <description>DM voltage</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>DP_STATE</name>
              <description>DP voltage</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>SECDET_DCP</name>
              <description>Battery Charging Secondary Detection phase output</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB1_CHRG_DET_STAT_CLR</name>
          <description>Charger Detect Status Register</description>
          <addressOffset>0xF8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>PLUG_CONTACT</name>
              <description>Battery Charging Data Contact Detection phase output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>CHRG_DETECTED</name>
              <description>Battery Charging Primary Detection phase output</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>DM_STATE</name>
              <description>DM voltage</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>DP_STATE</name>
              <description>DP voltage</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>SECDET_DCP</name>
              <description>Battery Charging Secondary Detection phase output</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB1_CHRG_DET_STAT_TOG</name>
          <description>Charger Detect Status Register</description>
          <addressOffset>0xFC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToToggle</modifiedWriteValues>
          <fields>
            <field>
              <name>PLUG_CONTACT</name>
              <description>Battery Charging Data Contact Detection phase output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>CHRG_DETECTED</name>
              <description>Battery Charging Primary Detection phase output</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>DM_STATE</name>
              <description>DM voltage</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>DP_STATE</name>
              <description>DP voltage</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>SECDET_DCP</name>
              <description>Battery Charging Secondary Detection phase output</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ANACTRL</name>
          <description>Analog Control Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2000400</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LVI_EN</name>
              <description>LVI enable for USB 3.3 V monitor circuit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LVI_3V_DISABLE</name>
                  <description>Disable the internal low voltage detector for the USB 3.3 V and 1.8 V domain</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVI_3V_ENABLE</name>
                  <description>Enable the internal low voltage detector for the USB 3.3 V and 1.8 V domain</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFD_CLK_SEL</name>
              <description>PFD clock output mux control</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PFD_CLK_BYPASS</name>
                  <description>USB1PFDCLK is the same frequency as the USB PLL reference clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFD_CLK_DIV_4</name>
                  <description>USB1PFDCLK frequency is pfd_clk divided by 4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFD_CLK_DIV_2</name>
                  <description>USB1PFDCLK frequency is pfd_clk divided by 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFD_CLK_DIV_1</name>
                  <description>USB1PFDCLK is the same as the pfd_clk frequency</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEV_PULLDOWN</name>
              <description>Device pulldown enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEV_PULLDOWN_DIS</name>
                  <description>The 15 kohm nominal pulldowns on the USB_DP and USB_DM pins are disabled for Device mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEV_PULLDOWN_EN</name>
                  <description>The 15 kohm nominal pulldowns on the USB_DP and USB_DM pins are enabled for Device mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ANACTRL_SET</name>
          <description>Analog Control Register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2000400</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToSet</modifiedWriteValues>
          <fields>
            <field>
              <name>LVI_EN</name>
              <description>LVI enable for USB 3.3 V monitor circuit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>PFD_CLK_SEL</name>
              <description>PFD clock output mux control</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>DEV_PULLDOWN</name>
              <description>Device pulldown enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ANACTRL_CLR</name>
          <description>Analog Control Register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2000400</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>LVI_EN</name>
              <description>LVI enable for USB 3.3 V monitor circuit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>PFD_CLK_SEL</name>
              <description>PFD clock output mux control</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>DEV_PULLDOWN</name>
              <description>Device pulldown enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ANACTRL_TOG</name>
          <description>Analog Control Register</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2000400</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToToggle</modifiedWriteValues>
          <fields>
            <field>
              <name>LVI_EN</name>
              <description>LVI enable for USB 3.3 V monitor circuit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>PFD_CLK_SEL</name>
              <description>PFD clock output mux control</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>DEV_PULLDOWN</name>
              <description>Device pulldown enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIM_OVERRIDE_EN</name>
          <description>Trim Register</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV_SEL_OVERRIDE</name>
              <description>Override enable for PLL divider value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USE_TRIM0_PLLDIV</name>
                  <description>Use the TRIM_OVERRIDE_EN register values for the PLL divider value</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_PLL_SIC_PLLDIV</name>
                  <description>Use the PLL_SIC register values for the PLL divider value</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_D_CAL_OVERRIDE</name>
              <description>Override enable for HS Tx output current trim</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USE_TRIM0_DCAL</name>
                  <description>Use the TRIM_OVERRIDE_EN register values for HS Tx output current trim</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_TX_DCAL</name>
                  <description>Use the Tx register values for HS Tx output current trim</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_CAL45DP_OVERRIDE</name>
              <description>Override enable for USB_DP series termination trim</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USE_TRIM0_CAL45DP</name>
                  <description>Use the TRIM_OVERRIDE_EN register values for DP resistance trim</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_TX_CAL45DP</name>
                  <description>Use the Tx register values for DP resistance trim</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_CAL45DM_OVERRIDE</name>
              <description>Override enable for USB_DM series termination trim</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USE_TRIM0_CAL45DN</name>
                  <description>Use the TRIM_OVERRIDE_EN register values for DM resistance trim</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_TX_CAL45DN</name>
                  <description>Use the Tx register values for DM resistance trim</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_CTRL0_DIV_SEL</name>
              <description>PLL divider value configuration bits from outside USBPHY</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USBPHY_TX_D_CAL</name>
              <description>HS Tx output current trim bits from outside USBPHY</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USBPHY_TX_CAL45DP</name>
              <description>DP series termination resistance trim bits from outside USBPHY.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USBPHY_TX_CAL45DN</name>
              <description>DM series termination resistance trim bits from outside USBPHY.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
